<?xml version="1.0"?>
<content collectionGUID="642BD7FC-9115-4D72-9F48-3DD4F809E1DB">
  <lastEdited clientType="local-build-20140819" date="2014-08-19 14:30:48 +0000"/>
  <textBox id="generic-header-attribute" dynamic="no" visible="yes">
    <richText>Artigos, tutoriais e Dicas - Carlos Delfino</richText>
  </textBox>
  <textBox id="generic-title-attributes" dynamic="no" visible="yes">
    <richText>Configurando o Asterisk para os primeiros passos</richText>
  </textBox>
  <textBox id="generic-datefield-attributes" dynamic="no" visible="yes">
    <richText>ter&#xE7;a-feira, 24 de junho de 2014</richText>
  </textBox>
  <image id="generic-picture-attributes" dynamic="no" visible="yes" src="24_Configurando_o_Asterisk_para_os_primeiros_passos_files/shapeimage_1.png" left="0px" top="0px" width="420px" height="236px"/>
  <textBox id="generic-body-attributes" dynamic="no" visible="yes">
    <richText>Acreditamos que voc&#xEA; ja tenha tido sucesso em instalar o Asterisk conforme o tutorial &#x201C;&#xD;&lt;a href="http://carlosdelfino.eti.br/Carlos_Delfino_-_Consultoria_e_Projetos/Artigos/Entradas/2014/6/24_Instalacao_do_Asterisk_para_uso_com_Arduino.html"&gt;Instala&#xE7;&#xE3;o do Asterisk para Uso com Arduino&#x201D;&lt;/a&gt;&#xD;&#xD;O primeiro passo a ser dado com o Asterisk, ap&#xF3;s sua instala&#xE7;&#xE3;o, ser&#xE1; configurar as extens&#xF5;es e canais de comunica&#xE7;&#xE3;o, usaremos apenas um tipo de canal,  controlado pelos protocolos SIP, o que ser&#xE1; suficiente para tudo que desejamos apresentar e muito mais.&#xD;&#xD;Antes de Come&#xE7;ar, Alguns Conceitos&#xD;&#xD;Para se usar o Asterisk &#xE9; preciso consolidar alguns conceitos, dentre eles:&#xD;&#xD;	&#x2022;	Canais de Audio&#xD;	&#x2022;	&lt;a href="http://goo.gl/wvgPGw"&gt;Ramais&lt;/a&gt;&#xD;	&#x2022;	&lt;a href="http://goo.gl/uVdtp9"&gt;URA&lt;/a&gt;&#xD;	&#x2022;	Planos de Discagem&#xD;	&#x2022;	M&#xF3;dulos/Extens&#xF5;es&#xD;&#xD;Considerando que voc&#xEA; j&#xE1; conhece tais conceitos vamos continuar.&#xD;&#xD;Arquivos de configura&#xE7;&#xE3;o Importantes&#xD;&#xD;Durante a instala&#xE7;&#xE3;o usamos o comando &#x201C;make samples&#x201D; para que tenhamos configura&#xE7;&#xF5;es padr&#xF5;es para uso do Asterisk, mas estas configura&#xE7;&#xF5;es n&#xE3;o nos atende, portanto vamos fazer um backup delas, criando um diret&#xF3;rio &#x201C;backup&#x201D; e movendo todos os arquivos que est&#xE3;o na pasta &#x201C;/etc/asterisk&#x201D; para a pasta de bakcup, por&#xE9;m mantenha uma copia dos seguintes arquivos:&#xD;&#xD;	&#x2022;	asterisk.conf&#xD;	&#x2022;	indications.conf&#xD;	&#x2022;	logger.conf&#xD;	&#x2022;	cel.conf&#xD;	&#x2022;	features.conf&#xD;	&#x2022;	modules.conf&#xD;&#xD;Deixe todos os arquivos intactos, por&#xE9;m sugiro que liste o conte&#xFA;do de cada um para se familiarizar mais com as configura&#xE7;&#xF5;es, o arquivo asterisk.conf e logger.conf podem ter configura&#xE7;&#xF5;es de depura&#xE7;&#xE3;o alteradas para melhorar a visualiza&#xE7;&#xE3;o de mensagens de erros.&#xD;&#xD;Quais M&#xF3;dulos iremos Usar&#xD;&#xD;O primeiro arquivo que vamos intervir &#xE9; o arquivo &#x201C;modules.conf&#x201D;, este arquivo informa ao Asterisk como carregar os m&#xF3;dulos necess&#xE1;rio ao nosso ambiente. O Asterisk &#xE9; um software totalmente modular e al&#xE9;m de vir com todos os m&#xF3;dulos/extens&#xF5;es necess&#xE1;rios para nosso trabalho, possui uma API bem madura para se desenvolver novos m&#xF3;dulos.&#xD;&#xD;Neste arquivo originalmente ele pede para que o Asterisk fa&#xE7;a a carga autom&#xE1;tica dos m&#xF3;dulos, por&#xE9;m queremos carregar apenas m&#xF3;dulos que nos s&#xE3;o interessantes, j&#xE1; que com a carga autom&#xE1;tica &#xE9; carregado uma grande quantidade de m&#xF3;dulos desnecess&#xE1;rios. &#xD;&#xD;Portanto vamos criar um arquivo novo com apenas os m&#xF3;dulos que iremos precisar em nosso Workshop.&#xD;&#xD;Vamos come&#xE7;&#xE1;r criando o arquivo de novo &#x201C;modules.conf&#x201D; e na primeira linha coloque a diretiva que indica inicio de sec&#xE3;o &#x201C;[modules]&#x201D;, em seguida na pr&#xF3;xima linha coloque o parametro &#x201C;autoload&#x201D;, com a op&#xE7;&#xE3;o &#x201C;no&#x201D;, veja abaixo o exemplo de com ficar&#xE1; o arquivo, neste exemplo j&#xE1; listo todos os m&#xF3;dulos necess&#xE1;rios e como devem ser carregados:&#xD;&#xD;Agora abaixo da diretiva autoload, coloque as diretivas conforme o exemplo a seguir, explicarei depois do exemplo os grupos de diretivas:&#xD;&#xD;[modules]&#xD;autoload=no&#xD;;&#xD;; Modulo de Configura&#xE7;&#xE3;o por Arquivo&#xD;preload=pbx_config.so&#xD;;&#xD;; M&#xF3;dulos de Aplica&#xE7;&#xE3;o com fun&#xE7;&#xF5;es para planos de discagem&#xD;load=app_system.so&#xD;load=app_verbose.so&#xD;load=app_dial.so&#xD;load=app_record.so&#xD;load=app_userevent.so&#xD;load=app_playtones.so&#xD;load=app_playback.so&#xD;load=app_sayunixtime.so&#xD;;&#xD;; Recursos&#xD;load=res_rtp_asterisk.so&#xD;; Recurso que ira fazer a integrac&#xE3;o com scripts que se comunicam com Arduino&#xD;load=res_agi.so&#xD;;&#xD;; Codecs de Audio&#xD;load=codec_alaw.so&#xD;load=codec_ulaw.so&#xD;load=codec_gsm.so&#xD;load=codec_ilbc.so&#xD;;&#xD;; Fun&#xE7;&#xF5;es para Planos de Discagem&#xD;load=func_dialgroup.so&#xD;load=func_dialplan.so&#xD;load=func_callerid.so&#xD;load=func_channel.so&#xD;;&#xD;; Canais de Audio Local&#xD;noload=chan_alsa.so&#xD;noload=chan_oss.so&#xD;load=chan_console.so&#xD;; Canais de Audio VOIP, usaremos apenas SIP para os ramais&#xD;load=chan_sip.so&#xD;load=chan_aix.so&#xD;;&#xD;; Formatos de audio, observe diretiva &#x201C;noload&#x201D;, diz para n&#xE3;o carregar&#xD;noload=format_g719.so&#xD;load=format_ilbc.so&#xD;load=format_g723.so&#xD;load=format_jpeg.so&#xD;load=format_sln.so&#xD;noload=format_sln16.so&#xD;noload=format_g726.so&#xD;noload=format_mp3.so&#xD;load=format_vox.so&#xD;load=format_g729.so&#xD;load=format_ogg_vorbis.so&#xD;load=format_wav_gsm.so&#xD;load=format_gsm.so&#xD;load=format_pcm.so&#xD;load=format_wav.so&#xD;noload=format_h263.so&#xD;noload=format_siren14.so&#xD;noload=format_h264.so&#xD;noload=format_siren7.so&#xD;&#xD;Como pode ser visto nos coment&#xE1;rios, carregamos primeiro um modulo que ir&#xE1; cuidar da configura&#xE7;&#xE3;o, este modulo nos oferece recurso como recargar de configura&#xE7;&#xE3;o, e principalmente a possibilidade de se usar arquivos de configura&#xE7;&#xE3;o em formato texto.&#xD;&#xD;O m&#xF3;dulo de configura&#xE7;&#xE3;o e carregado com a diretiva &#x201C;preload&#x201D; para que seja carregado com anteced&#xEA;ncia.&#xD;&#xD;Em seguida, carregamos m&#xF3;dulos de aplica&#xE7;&#xE3;o e &#xFA;teis ao plano de discagem, por&#xE9;m o que mais nos interessa e que iremos lidar mais, al&#xE9;m do plano de discagem propriamente dito, ser&#xE1; o m&#xF3;dulo &#x201C;res_agi.so&#x201D;, este m&#xF3;dulo &#xE9; respons&#xE1;vel pela integra&#xE7;&#xE3;o com aplica&#xE7;&#xF5;es externas, funcionando como um Gateway para o Asterisk e tais aplica&#xE7;&#xF5;es, ser&#xE1; atrav&#xE9;s deste recurso que iremos ver como desenvolver scripts para se comunicar com o Arduino.&#xD;&#xD;Os m&#xF3;dulos de prefixo &#x201C;chan_&#x201D;, criam os canais de audio e voip necess&#xE1;rio ao funcionamento do Asterisk e todo o PBX e os m&#xF3;dulos de prefixo &#x201C;format_&#x201D; carregam recursos para tratamentos dos arquivos de &#xE1;udio nos formatos identificados, ser&#xE3;o &#xFA;teis para gravar e reproduzir arquivos de &#xE1;udio.&#xD;&#xD;Ap&#xF3;s esta mudan&#xE7;a precisamos reiniciar o Asterisk j&#xE1; que fizemos muda&#xE7;as em praticamente todos os arquivos de configura&#xE7;&#xE3;o, reiniciando &#xE9; mais seguro se ter o resultado desejado.&#xD;&#xD;Por&#xE9;m, ao se alterar apenas arquivos de configura&#xE7;&#xF5;es pode se usar o comando &#x201C;rasterisk&#x201D; que veremos a seguir.&#xD;&#xD;Pr&#xF3;ximos Passos&#xD;Veremos no pr&#xF3;ximo tutorial como criar nosso primeiro canal de comunica&#xE7;&#xE3;o e nossos ramais. Aguardem.&#xD;&#xD;Mais Informa&#xE7;&#xF5;es:&#xD;Outras informa&#xE7;&#xF5;es sobre o Workshop podem ser obtidos no link: &lt;a href="https://www.facebook.com/events/1500419536839268/?ref=ts&amp;fref=ts"&gt;https://www.facebook.com/events/1500419536839268/&lt;/a&gt;</richText>
  </textBox>
</content>
