<?xml version="1.0"?>
<rss xmlns:iweb="http://www.apple.com/iweb" version="2.0">
  <channel>
    <title>Pensamentos</title>
    <link>http://www.carlosdelfino.eti.br/Carlos_Delfino_-_Consultoria_e_Projetos/Pensamentos</link>
    <description>As vezes me ocorre alguamas reflex&#xF5;es, para no tempo e revejo o passado, ou o que est&#xE1; acontecendo, nem sempre est&#xE1; no meu dom&#xED;nio, nem sempre termino com um racioc&#xED;nio claro.

As vezes sou mal entendido, ou n&#xE3;o me expresso corretamente, mas vou tentando.</description>
    <item>
      <title>Terrorismo Digital e o Hero&#xED;smo, para quem?</title>
      <link>http://www.carlosdelfino.eti.br/Carlos_Delfino_-_Consultoria_e_Projetos/Pensamentos/Entradas/2014/6/1_Terrorismo_Digital_e_o_Heroismo,_para_quem.html</link>
      <guid isPermaLink="false">e04fac66-31a9-4f8d-9798-9712162fc021</guid>
      <pubDate>Sun, 1 Jun 2014 23:11:55 -0300</pubDate>
      <description>Esta quest&#xE3;o relativa a espionagem &#xE9; bastante complexa.&lt;br/&gt;&lt;br/&gt;Antes de continuar, saiba que ao curtir uma publica&#xE7;&#xE3;o ou at&#xE9; sendo um amigo, vc se torna de certa forma meu c&#xFA;mplice, sim para ag&#xEA;ncias de espionagens qualquer conex&#xE3;o mesmo digital pode ser uma conex&#xE3;o suspeita.&lt;br/&gt;&lt;br/&gt;De uma forma ou de outra, vc est&#xE1; sendo investigado.&lt;br/&gt;&lt;br/&gt;Eu, sim, posso estar sendo investigado, fui mission&#xE1;rio, me tornei mu&#xE7;ulmano, fui fotografado na mesquita, e investigado se era ou n&#xE3;o terrorista, &#xE9; assim que funciona a espionagem.&lt;br/&gt;&lt;br/&gt;Por&#xE9;m, o Edward Snowden &#xE9; nosso her&#xF3;i? &#xE9; meu her&#xF3;i? &#xE9; seu her&#xF3;i? como brasileiro poderia dizer que sim, e se ele fosse brasileiro e tivesse revelado tais pr&#xE1;ticas no Brasil? ele seria her&#xF3;i para algum Brasileiro?&lt;br/&gt;&lt;br/&gt;Est&#xE1; ele mesmo a favor da liberdade de express&#xE3;o? ou apenas mais um pi&#xE3;o no mercado midi&#xE1;tico? Quem hoje em tempos de capitalismo, abre m&#xE3;o de sua fam&#xED;lia, sua nacionalidade ou mesmo simplesmente o seus costumes e sua vida em seu pais? sem ser por dinheiro? sem ser por um beneficio pr&#xF3;prio?&lt;br/&gt;&lt;br/&gt;Estaria ele realmente revoltado com a hipocrisia pol&#xED;tica, com a mentira e manipula&#xE7;&#xE3;o para se manter e proteger tudo que ele vive e sempre defendeu?&lt;br/&gt;&lt;br/&gt;Bem, isso &#xE9; apenas uma reflex&#xE3;o, mas sim ele s&#xF3; &#xE9; nosso her&#xF3;i porque sa&#xED;mos favorecidos aparentemente.</description>
      <iweb:image href="Media/object002.jpg"></iweb:image>
      <iweb:comment enabled="0" count="0" link="http://www.carlosdelfino.eti.br/Carlos_Delfino_-_Consultoria_e_Projetos/Pensamentos/Entradas/2014/6/1_Terrorismo_Digital_e_o_Heroismo,_para_quem.html#comment_layer"></iweb:comment>
    </item>
    <item>
      <title>A copa do MUndo, os investimentos do Governo, e nossas a&#xE7;&#xF5;es!</title>
      <link>http://www.carlosdelfino.eti.br/Carlos_Delfino_-_Consultoria_e_Projetos/Pensamentos/Entradas/2014/5/8_Reflexos_no_lago.html</link>
      <guid isPermaLink="false">a454f925-4bee-4dad-98fa-5f84d4681caf</guid>
      <pubDate>Thu, 8 May 2014 14:31:30 -0300</pubDate>
      <description>O Governo diz que os investimentos da copa n&#xE3;o interferiram nos investimentos em outros setores como sa&#xFA;de e educa&#xE7;&#xE3;o, eu acredito. At&#xE9; mesmo porque &#xE9; t&#xE3;o pouco o investimento nestes setores que realmente a interfer&#xEA;ncia deve ser t&#xE3;o pequena que vale ser ignorada.&lt;br/&gt;&lt;br/&gt;Eu estou como meus colegas, cansado de falar, j&#xE1; vi que n&#xE3;o adianta nada, o governo faz o que quer como lhe conv&#xE9;m, o povo busca suas solu&#xE7;&#xF5;es como podem.&lt;br/&gt;&lt;br/&gt;Alguns postam no Facebook apenas memes, outros como eu escrevem seus pensamentos, outros v&#xE3;o para as ruas e levantam bandeiras, at&#xE9; pintam o rosto, j&#xE1; outros mais agressivos at&#xE9; colocam fogo nos &#xF4;nibus.&lt;br/&gt;&lt;br/&gt;Aproveitando este t&#xF3;pico sobre colocar fogo nos &#xF3;nibus, quero dizer n&#xE3;o sou a favor de vandalismo generalizado e saques, quando defendi o ato b&#xE1;rbaro, e como alguns disseram infantil de incendiar tais &#xF3;nibus, bem sem ficar dando nomes a atitude destas pessoas, &#xE9; fundamental analisar e viv&#xEA;nciar por algum instante a vida destas pessoas. Eu por exemplo n&#xE3;o teria nunca coragem de por fogo o depredar algum bem seja publico ou privado, por mais &#xF3;dio que este me provoque.&lt;br/&gt;&lt;br/&gt;E olha o governo parece que est&#xE1; realmente provocando &#xF3;dio nas pessoas, &#xE9; muito pouco caso, voltando a copa, a propor&#xE7;&#xE3;o e qualidade dos investimento que foram feitos neste evento, perto do que &#xE9; feito em outros setores &#xE9; desrespeitoso.&lt;br/&gt;&lt;br/&gt;Vou tentar uma analogia e espero que seja feliz, &#xE9; como construir uma garagem autom&#xE1;tica em minha casa, e logo em seguida uma bela sala de estar com TV de 50 polegadas, ambiente totalmente climatizado, sem sequer eu ter um carro, e poder manter TV por assinatura, al&#xE9;m de deixar minha cozinha e banheiro sem reformas e condi&#xE7;&#xF5;es de uso adequado. E depois ficar justificando que um bom fog&#xE3;o, geladeira e sanit&#xE1;rios modernos s&#xE3;o muito caros e a manuten&#xE7;&#xE3;o muito cara.&lt;br/&gt;&lt;br/&gt;Bem, o que me questiono agora, &#xE9; a quem pertence nosso pais, quantas vezes n&#xE3;o disse que somos uma col&#xF4;nia? quando &amp;quot;descobertos&amp;quot; por Portugal levaram minerais e preciosidades de nossa terra, o que at&#xE9; onde sei ainda &#xE9; levado porque n&#xE3;o detemos totalmente as tecnologias para tal produ&#xE7;&#xE3;o, ainda mais de produtos como os necess&#xE1;rios para eletr&#xF4;nica, as telecomunica&#xE7;&#xF5;es, e nem vou dizer da energia nuclear, que muitos falam mau, mas agente precisa pelo menos domina-la, j&#xE1; que ser&#xE1; ela que nos colocar&#xE1; em corridas especificas por uma sustentabilidade no passar das gera&#xE7;&#xF5;es.&lt;br/&gt;&lt;br/&gt;Eu vejo e sinto o desprezo e deboche de pessoas que dizem amar nosso pais, mas n&#xE3;o os vejo fazer nada pela sociedade como um todo, seus atos s&#xE3;o ego&#xED;stas e para beneficio pr&#xF3;prio e quando al&#xE9;m de seu umbigo, s&#xE3;o atos que beneficiam seu grupo exclusivamente.  &lt;br/&gt;&lt;br/&gt;eu vejo outros solit&#xE1;rios tentando fazer a&#xE7;&#xF5;es que podem ser replicadas por todos, mas n&#xE3;o a&#xE7;&#xF5;es que viabilizem a replica&#xE7;&#xE3;o por quem realmente precisa.&lt;br/&gt;&lt;br/&gt;E me parece tudo t&#xE3;o repetitivo, sem solu&#xE7;&#xE3;o, sei que os muitos ir&#xE3;o dizer que devo me conformar, que &#xE9; bobagem se preocupar, outros dir&#xE3;o que &#xE9; a vontade de Deus, e outros bater&#xE3;o seus ombros como se n&#xE3;o se importa-sem, mas ao virarem olharam por debaixo de suas sobrancelhas, com tristeza por lhes faltar coragem, fora os que guardam rancor por terem sido atingidos, mas n&#xE3;o terem tido for&#xE7;a para lutar.</description>
      <iweb:image href="Media/object001.jpg"></iweb:image>
      <iweb:comment enabled="0" count="0" link="http://www.carlosdelfino.eti.br/Carlos_Delfino_-_Consultoria_e_Projetos/Pensamentos/Entradas/2014/5/8_Reflexos_no_lago.html#comment_layer"></iweb:comment>
    </item>
    <iweb:dateFormat>EEEE, d 'de' MMMM 'de' y</iweb:dateFormat>
    <iweb:baseURL>http://www.carlosdelfino.eti.br/Carlos_Delfino_-_Consultoria_e_Projetos/Pensamentos</iweb:baseURL>
    <iweb:maximumSummaryItems>5</iweb:maximumSummaryItems>
  </channel>
</rss>
