<?xml version="1.0"?>
<content collectionGUID="642BD7FC-9115-4D72-9F48-3DD4F809E1DB">
  <lastEdited clientType="local-build-20140819" date="2014-08-19 14:30:51 +0000"/>
  <textBox id="generic-header-attribute" dynamic="no" visible="yes">
    <richText>Artigos, tutoriais e Dicas - Carlos Delfino</richText>
  </textBox>
  <textBox id="generic-title-attributes" dynamic="no" visible="yes">
    <richText>Conceitos relativos ao Asterisk e VOIP</richText>
  </textBox>
  <textBox id="generic-datefield-attributes" dynamic="no" visible="yes">
    <richText>sexta-feira, 11 de julho de 2014</richText>
  </textBox>
  <image id="generic-picture-attributes" dynamic="no" visible="yes" src="11_Conceitos_relativos_ao_Asterisk_e_VOIP_files/shapeimage_1.png" left="0px" top="0px" width="420px" height="200px"/>
  <textBox id="generic-body-attributes" dynamic="no" visible="yes">
    <richText>	&#x2022;	 PBX (Private Branch Exchange)&#x2028;&#xE9; uma pequena central telefonica que pode ter apenas dois pontos de conex&#xE3;o telef&#xF4;nicos ou at&#xE9; mesmo centenas.&#x2028;&#xD;	&#x2022;	 Virtual PBX&#x2028;&#xC9; o mesmo que PBX por&#xE9;m instalado remotamente em uma operadora ou mesmo criado atrav&#xE9;s de softwares, podendo usar VOIP para comunica&#xE7;&#xE3;o entre os terminas.&#x2028;&#xD;	&#x2022;	IVR (Interactive Voice Response) ou URA (unidade de resposta aud&#xED;vel)&#x2028;O IVR ou URA &#xE9; um recurso muito valioso em centrais telefonicas do tipo PBX, j&#xE1; que com este recurso podemos fazer atentimentos autom&#xE1;ticos e distribuir a chamada conforme respostas do usu&#xE1;rio, al&#xE9;m disso podemos integrar a URA com o Arduino permitindo assim uma intera&#xE7;&#xE3;o totalmente autom&#xE1;tica entre o usu&#xE1;rio e o Arduino ou o Arduino e o Asterisk para fazer liga&#xE7;&#xF5;es para o usu&#xE1;rio.&#x2028;&#xD;	&#x2022;	ACD (Automatic Call Distribution)&#x2028;ACD permite que as liga&#xE7;&#xF5;es que chegam a central PBX sejam distribu&#xED;das conformem regras pre-estabelecidas, integrando a central com o Arduino podemos intervir nas regras de chamada conforme par&#xE2;metros coletados por ele.&#x2028;&#xD;	&#x2022;	 FXO e FXS&#x2028;Foreign Exchange Office e Foreign Exchange Sation, s&#xE3;o tipos de canais (Channel), s&#xE3;o canais telef&#xF4;nicos como em centrais PBXs, &#x2028;A FXO &#xE9; como um aparelho telef&#xF4;nico, recebe sinais de controle como o sinal de chamada.&#x2028;J&#xE1; a FXS &#xE9; como uma sa&#xED;da da central telef&#xF4;nica gerando sinaliza&#xE7;&#xE3;o e tamb&#xE9;m oferece alimenta&#xE7;&#xE3;o el&#xE9;trica para funcionamento do aparelho telef&#xF4;nico.&#x2028;Por exemplo para se conectar uma linha telef&#xF4;nica comum (PSTN) a um computador voc&#xEA; precisa de um placa que tenha uma entrada FXO. J&#xE1; para ligar seu telefone ao computador e este simular uma central telefonica voc&#xEA; precisa de um canal FXS.&#x2028;&lt;b&gt;&#xD;&lt;/b&gt;	&#x2022;	 PSTN (PUBLIC SWITCHED TELEPHONE NETWORK)&#x2028;&#xC9; a sua operadora telef&#xF4;nica, em especial toda a infraestrutura que a constr&#xF5;e.&#x2028;&#xD;	&#x2022;	 POTS (Plain Old Telephone Service)&#x2028;&#xC9; o sistema telef&#xF4;nico cl&#xE1;ssico, amplamente utilizado no mundo, mesmo com o advento de linhas telef&#xF4;nicas como ISDN, ADSL, Fibra &#xD3;tica e Telefonica Celular.&#x2028;&#xD;	&#x2022;	 ATA (Analog Telephone Adapter)&#x2028;ATA &#xE9; um adaptador de telefone comum para telefone IP, permitindo que se conecte um telefone padr&#xE3;o a sua rede IP e assim receber e fazer chamadas, um ATA normalmente &#xE9; um dispositivo FXS.&#x2028;&#xD;	&#x2022;	 Channel&#x2028;S&#xE3;o canais de comunica&#xE7;&#xE3;o, por onde h&#xE1; trafego de dados ou audio entre por exemplo o Asterisk e um ATA, no Asterisk n&#xE3;o se distingue canais originador ou destino de chamada, nem mesmo canais FXO ou FXS.&#x2028;&#xD;	&#x2022;	 SIP&#x2028;&#xD;	&#x2022;	 Console</richText>
  </textBox>
</content>
