<?xml version="1.0"?>
<content collectionGUID="642BD7FC-9115-4D72-9F48-3DD4F809E1DB">
  <lastEdited clientType="local-build-20140819" date="2014-08-19 14:30:51 +0000"/>
  <textBox id="generic-header-attribute" dynamic="no" visible="yes">
    <richText>Artigos, tutoriais e Dicas - Carlos Delfino</richText>
  </textBox>
  <textBox id="generic-title-attributes" dynamic="no" visible="yes">
    <richText>Integrando Asterisk com Google Speech para uso com Arduino</richText>
  </textBox>
  <textBox id="generic-datefield-attributes" dynamic="no" visible="yes">
    <richText>segunda-feira, 21 de julho de 2014</richText>
  </textBox>
  <image id="generic-picture-attributes" dynamic="no" visible="yes" src="21_Integrando_Asterisk_com_Google_Speech_para_uso_com_Arduino_files/shapeimage_1.png" left="0px" top="0px" width="414px" height="172px"/>
  <textBox id="generic-body-attributes" dynamic="no" visible="yes">
    <richText>O Google possui um servi&#xE7;o de reconhecimento da fala, e um complementar que &#xE9; o de leitura de texto, o primeiro Chamado de Google Speech-to-Text e o segundo chamado de Google Text-to-Speech. Usando os dois servi&#xE7;os podemos obter novas funcionalidades no Asterisk, como a leitura de noticias, dados que possam estar dispon&#xED;vel em servi&#xE7;os internos da empresa relativos a relat&#xF3;rios montados automaticamente ou mesmo pelo funcion&#xE1;rio.&#xD;&#xD;Mas o mais interessante no nosso contexto, em especial considerando a Internet das Coisas (IoT - Internet of Things) onde podemos dar voz as coisas quando estas se comunicando pelo Asterisk. A ideia &#xE9; quando o usu&#xE1;rio fizer uma liga&#xE7;&#xE3;o para um determinado ramal que perten&#xE7;a a algo que est&#xE1; integrado este lhe informe detalhes de seu estado, ou mesmo quando algo atingir um determinado limite como uma planta com pouca agua, seja feita uma liga&#xE7;&#xE3;o interconectando quem cuida da planta com esta, e assim a planta enviando uma mensagem informando o que deseja, podendo ser que seja regada ou mesmo que seja mudado sua posi&#xE7;&#xE3;o devido a temperatura do ambiente.&#xD;&#xD;Configurando o Google Speech&#xD;Bem, o que desejamos ent&#xE3;o e dar voz a esta planta para que ela possa usar o sistema de ramais da sua casa ou empresa, para isso usaremos como dito a cima o Google Speech.&#xD;&#xD;Bem para usarmos o Google Text-to-Speech, abreviando Google TTS, n&#xE3;o precisamos anda al&#xE9;m do texto um script e o acesso a internet para obter do Google o audio referente ao texto.&#xD;&#xD;Mas, para obter o texto com base no audio, precisamos ter tamb&#xE9;m uma conta no Google APP, ent&#xE3;o vamos conversar para ai.&#xD;&#xD;Criando uma Chave de Acesso&#xD;Visite a URL: &lt;a href="https://console.developers.google.com/project"&gt;https://console.developers.google.com/project&lt;/a&gt;&#xD;Crie um projeto, ative a API do Google Speech no menu &#x201C;APIs&#x201D; e crie uma chave de acesso (key) no menu credencial, n&#xE3;o entraremos aqui em detalhes sobre isso, mas &#xE9; bem simples, tal chave deve ser criada visitando o menu &#x201C;Credential&#x201D; e clicando no bot&#xE3;o &#x201C;Create New Key&#x201D;, ent&#xE3;o clique na nova janela no bot&#xE3;o &#x201C;Browser Key&#x201D;, deixe o campo texto que surgiu em branco e clique finalmente no bot&#xE3;o &#x201C;create&#x201D;.&#xD;&#xD;Eu irei fornecer aqui uma chave de testes, que estar&#xE1; dispon&#xED;vel enquanto ela n&#xE3;o for usada com abuso, ou seja um total de 50 requisi&#xE7;&#xF5;es por dia, portanto fa&#xE7;a seus testes com ela se n&#xE3;o quiser criar agora uma conta para voc&#xEA;.&#xD;&#xD;Instalando os pr&#xE9;-requisitos para trabalhar com Audio e o Google Speech&#xD;Para convertermos os arquivos de forma a obter o reconhecimento do audio e sua convers&#xE3;o para o Google Speech-To-Text (Google STT), precisamos de alguns bibliotecas e ferramentas.&#xD;&#xD;O Google STT, reconhece dois formatos de audio, o FLAC e o SPX conhecido como SPEEX, este &#xFA;ltimo &#xE9; um formato padr&#xE3;o para reconhecimento da fala em ferramentas gratuitas, por&#xE9;m usaremos aqui apenas o FLAC.&#xD;&#xD;Para trabalhar com o FLAC precisamos do conversor universal de audio o &#x201C;SOX&#x201D;,  entre outras bibliotecas que usaremos, ent&#xE3;o instale os seguintes requisitos e suas respectivas depend&#xEA;ncias em seu ambiente de trabalho, caso seja o linux e tenha o apt-get use &#x201C;apt-get install&#x201D; seguido dos nomes abaixo.&#xD;&#xD;	&#x2022;	curl&#xD;	&#x2022;	wget&#xD;	&#x2022;	flac&#xD;	&#x2022;	bison&#xD;	&#x2022;	git&#xD;	&#x2022;	libwww-perl&#xD;	&#x2022;	libjson-any-perl&#xD;	&#x2022;	speex&#xD;	&#x2022;	libspeex-dev&#xD;&#xD;O Script de intera&#xE7;&#xE3;o com o Asterisk&#xD;Para que possamos obter os arquivos textos que ser&#xE3;o enviados ao seu dispositivo controlado com o Arduino (ou outro controlador) precisamos de um script que ser&#xE1; acionado pelo AGI (Asterisk Gateway Interface).&#xD;&#xD;O Script ira obter o audio enviado pelo ramal, e em seguida enviado ao Google Speech-to-Text que devolver&#xE1; o texto interpretado, tal texto ser&#xE1; ent&#xE3;o lido pelo Google Texto-To-Speech para confirmar a solicita&#xE7;&#xE3;o e final enviado ao Arduino.&#xD;&#xD;</richText>
  </textBox>
</content>
