<?xml version="1.0"?>
<content collectionGUID="46D31CA3-FB98-41BF-985C-1FB0A30919F1">
  <lastEdited clientType="local-build-20140819" date="2014-08-19 14:31:01 +0000"/>
  <textBox id="generic-header-attribute" dynamic="no" visible="yes">
    <richText>Pensamentos de Carlos Delfino</richText>
  </textBox>
  <textBox id="generic-title-attributes" dynamic="no" visible="yes">
    <richText>Terrorismo Digital e o Hero&#xED;smo, para quem?</richText>
  </textBox>
  <textBox id="generic-datefield-attributes" dynamic="no" visible="yes">
    <richText>domingo, 1 de junho de 2014</richText>
  </textBox>
  <image id="generic-picture-attributes" dynamic="no" visible="yes" src="1_Terrorismo_Digital_e_o_Heroismo,_para_quem_files/shapeimage_1.png" left="0px" top="0px" width="420px" height="200px"/>
  <textBox id="generic-body-attributes" dynamic="no" visible="yes">
    <richText>Esta quest&#xE3;o relativa a espionagem &#xE9; bastante complexa.&#xD;&#xD;Antes de continuar, saiba que ao curtir uma publica&#xE7;&#xE3;o ou at&#xE9; sendo um amigo, vc se torna de certa forma meu c&#xFA;mplice, sim para ag&#xEA;ncias de espionagens qualquer conex&#xE3;o mesmo digital pode ser uma conex&#xE3;o suspeita.&#xD;&#xD;De uma forma ou de outra, vc est&#xE1; sendo investigado.&#xD;&#xD;Eu, sim, posso estar sendo investigado, fui mission&#xE1;rio, me tornei mu&#xE7;ulmano, fui fotografado na mesquita, e investigado se era ou n&#xE3;o terrorista, &#xE9; assim que funciona a espionagem.&#xD;&#xD;Por&#xE9;m, o Edward Snowden &#xE9; nosso her&#xF3;i? &#xE9; meu her&#xF3;i? &#xE9; seu her&#xF3;i? como brasileiro poderia dizer que sim, e se ele fosse brasileiro e tivesse revelado tais pr&#xE1;ticas no Brasil? ele seria her&#xF3;i para algum Brasileiro?&#xD;&#xD;Est&#xE1; ele mesmo a favor da liberdade de express&#xE3;o? ou apenas mais um pi&#xE3;o no mercado midi&#xE1;tico? Quem hoje em tempos de capitalismo, abre m&#xE3;o de sua fam&#xED;lia, sua nacionalidade ou mesmo simplesmente o seus costumes e sua vida em seu pais? sem ser por dinheiro? sem ser por um beneficio pr&#xF3;prio?&#xD;&#xD;Estaria ele realmente revoltado com a hipocrisia pol&#xED;tica, com a mentira e manipula&#xE7;&#xE3;o para se manter e proteger tudo que ele vive e sempre defendeu?&#xD;&#xD;Bem, isso &#xE9; apenas uma reflex&#xE3;o, mas sim ele s&#xF3; &#xE9; nosso her&#xF3;i porque sa&#xED;mos favorecidos aparentemente.</richText>
  </textBox>
</content>
