<?xml version="1.0"?>
<rss xmlns:iweb="http://www.apple.com/iweb" version="2.0">
  <channel>
    <title>Artigos</title>
    <link>http://www.carlosdelfino.eti.br/Carlos_Delfino_-_Consultoria_e_Projetos/Artigos</link>
    <description>SEmanalmente escrevo pequenas dicas e artigos para ajudar a compreender conceitos envoltos nas tecnologias que trabalho, contribuir para eliminar d&#xFA;vidas.

Caso tenha alguma d&#xFA;vida me envie por e-mail, lembre-se de descrever seu projeto.</description>
    <item>
      <title>Artigos antigos onde est&#xE3;o?</title>
      <link>http://www.carlosdelfino.eti.br/Carlos_Delfino_-_Consultoria_e_Projetos/Artigos/Entradas/2014/8/19_Artigos_antigos_onde_estao.html</link>
      <guid isPermaLink="false">8d6dcea6-9f76-4f68-b703-d3b4e5a55397</guid>
      <pubDate>Tue, 19 Aug 2014 11:28:23 -0300</pubDate>
      <description>Estou trabalhando na migra&#xE7;&#xE3;o do site para este site tempor&#xE1;rio, irei em breve trazer um novo visual, baseado no jekyll, aguardem.&lt;br/&gt;&lt;br/&gt;Caso haja algum artigo que se interessa que n&#xE3;o est&#xE1; aqui, me falei.&lt;br/&gt;Obrigado.</description>
      <iweb:image href="Media/object001.jpg"></iweb:image>
      <iweb:comment enabled="0" count="0" link="http://www.carlosdelfino.eti.br/Carlos_Delfino_-_Consultoria_e_Projetos/Artigos/Entradas/2014/8/19_Artigos_antigos_onde_estao.html#comment_layer"></iweb:comment>
    </item>
    <item>
      <title>Integrando Asterisk com Google Speech para uso com Arduino</title>
      <link>http://www.carlosdelfino.eti.br/Carlos_Delfino_-_Consultoria_e_Projetos/Artigos/Entradas/2014/7/21_Integrando_Asterisk_com_Google_Speech_para_uso_com_Arduino.html</link>
      <guid isPermaLink="false">b65adf9e-da4c-4e67-86a8-34202118589d</guid>
      <pubDate>Mon, 21 Jul 2014 18:48:03 -0300</pubDate>
      <description>O Google possui um servi&#xE7;o de reconhecimento da fala, e um complementar que &#xE9; o de leitura de texto, o primeiro Chamado de Google Speech-to-Text e o segundo chamado de Google Text-to-Speech. Usando os dois servi&#xE7;os podemos obter novas funcionalidades no Asterisk, como a leitura de noticias, dados que possam estar dispon&#xED;vel em servi&#xE7;os internos da empresa relativos a relat&#xF3;rios montados automaticamente ou mesmo pelo funcion&#xE1;rio.&lt;br/&gt;&lt;br/&gt;Mas o mais interessante no nosso contexto, em especial considerando a Internet das Coisas (IoT - Internet of Things) onde podemos dar voz as coisas quando estas se comunicando pelo Asterisk. A ideia &#xE9; quando o usu&#xE1;rio fizer uma liga&#xE7;&#xE3;o para um determinado ramal que perten&#xE7;a a algo que est&#xE1; integrado este lhe informe detalhes de seu estado, ou mesmo quando algo atingir um determinado limite como uma planta com pouca agua, seja feita uma liga&#xE7;&#xE3;o interconectando quem cuida da planta com esta, e assim a planta enviando uma mensagem informando o que deseja, podendo ser que seja regada ou mesmo que seja mudado sua posi&#xE7;&#xE3;o devido a temperatura do ambiente.&lt;br/&gt;&lt;br/&gt;Configurando o Google Speech&lt;br/&gt;Bem, o que desejamos ent&#xE3;o e dar voz a esta planta para que ela possa usar o sistema de ramais da sua casa ou empresa, para isso usaremos como dito a cima o Google Speech.&lt;br/&gt;&lt;br/&gt;Bem para usarmos o Google Text-to-Speech, abreviando Google TTS, n&#xE3;o precisamos anda al&#xE9;m do texto um script e o acesso a internet para obter do Google o audio referente ao texto.&lt;br/&gt;&lt;br/&gt;Mas, para obter o texto com base no audio, precisamos ter tamb&#xE9;m uma conta no Google APP, ent&#xE3;o vamos conversar para ai.&lt;br/&gt;&lt;br/&gt;Criando uma Chave de Acesso&lt;br/&gt;Visite a URL: &lt;a href="https://console.developers.google.com/project"&gt;https://console.developers.google.com/project&lt;/a&gt;&lt;br/&gt;Crie um projeto, ative a API do Google Speech no menu &#x201C;APIs&#x201D; e crie uma chave de acesso (key) no menu credencial, n&#xE3;o entraremos aqui em detalhes sobre isso, mas &#xE9; bem simples, tal chave deve ser criada visitando o menu &#x201C;Credential&#x201D; e clicando no bot&#xE3;o &#x201C;Create New Key&#x201D;, ent&#xE3;o clique na nova janela no bot&#xE3;o &#x201C;Browser Key&#x201D;, deixe o campo texto que surgiu em branco e clique finalmente no bot&#xE3;o &#x201C;create&#x201D;.&lt;br/&gt;&lt;br/&gt;Eu irei fornecer aqui uma chave de testes, que estar&#xE1; dispon&#xED;vel enquanto ela n&#xE3;o for usada com abuso, ou seja um total de 50 requisi&#xE7;&#xF5;es por dia, portanto fa&#xE7;a seus testes com ela se n&#xE3;o quiser criar agora uma conta para voc&#xEA;.&lt;br/&gt;&lt;br/&gt;Instalando os pr&#xE9;-requisitos para trabalhar com Audio e o Google Speech&lt;br/&gt;Para convertermos os arquivos de forma a obter o reconhecimento do audio e sua convers&#xE3;o para o Google Speech-To-Text (Google STT), precisamos de alguns bibliotecas e ferramentas.&lt;br/&gt;&lt;br/&gt;O Google STT, reconhece dois formatos de audio, o FLAC e o SPX conhecido como SPEEX, este &#xFA;ltimo &#xE9; um formato padr&#xE3;o para reconhecimento da fala em ferramentas gratuitas, por&#xE9;m usaremos aqui apenas o FLAC.&lt;br/&gt;&lt;br/&gt;Para trabalhar com o FLAC precisamos do conversor universal de audio o &#x201C;SOX&#x201D;,  entre outras bibliotecas que usaremos, ent&#xE3;o instale os seguintes requisitos e suas respectivas depend&#xEA;ncias em seu ambiente de trabalho, caso seja o linux e tenha o apt-get use &#x201C;apt-get install&#x201D; seguido dos nomes abaixo.&lt;br/&gt;&lt;br/&gt;	&#x2022;	curl&lt;br/&gt;	&#x2022;	wget&lt;br/&gt;	&#x2022;	flac&lt;br/&gt;	&#x2022;	bison&lt;br/&gt;	&#x2022;	git&lt;br/&gt;	&#x2022;	libwww-perl&lt;br/&gt;	&#x2022;	libjson-any-perl&lt;br/&gt;	&#x2022;	speex&lt;br/&gt;	&#x2022;	libspeex-dev&lt;br/&gt;&lt;br/&gt;O Script de intera&#xE7;&#xE3;o com o Asterisk&lt;br/&gt;Para que possamos obter os arquivos textos que ser&#xE3;o enviados ao seu dispositivo controlado com o Arduino (ou outro controlador) precisamos de um script que ser&#xE1; acionado pelo AGI (Asterisk Gateway Interface).&lt;br/&gt;&lt;br/&gt;O Script ira obter o audio enviado pelo ramal, e em seguida enviado ao Google Speech-to-Text que devolver&#xE1; o texto interpretado, tal texto ser&#xE1; ent&#xE3;o lido pelo Google Texto-To-Speech para confirmar a solicita&#xE7;&#xE3;o e final enviado ao Arduino.&lt;br/&gt;&lt;br/&gt;</description>
      <iweb:image href="Media/object002.jpg"></iweb:image>
      <iweb:comment enabled="0" count="0" link="http://www.carlosdelfino.eti.br/Carlos_Delfino_-_Consultoria_e_Projetos/Artigos/Entradas/2014/7/21_Integrando_Asterisk_com_Google_Speech_para_uso_com_Arduino.html#comment_layer"></iweb:comment>
    </item>
    <item>
      <title>Conceitos relativos ao Asterisk e VOIP</title>
      <link>http://www.carlosdelfino.eti.br/Carlos_Delfino_-_Consultoria_e_Projetos/Artigos/Entradas/2014/7/11_Conceitos_relativos_ao_Asterisk_e_VOIP.html</link>
      <guid isPermaLink="false">5aaccf15-9321-4cbd-8805-e99a11251846</guid>
      <pubDate>Fri, 11 Jul 2014 12:11:16 -0300</pubDate>
      <description>&#x2022;	 PBX (Private Branch Exchange)&#x2028;&#xE9; uma pequena central telefonica que pode ter apenas dois pontos de conex&#xE3;o telef&#xF4;nicos ou at&#xE9; mesmo centenas.&#x2028;&lt;br/&gt;	&#x2022;	 Virtual PBX&#x2028;&#xC9; o mesmo que PBX por&#xE9;m instalado remotamente em uma operadora ou mesmo criado atrav&#xE9;s de softwares, podendo usar VOIP para comunica&#xE7;&#xE3;o entre os terminas.&#x2028;&lt;br/&gt;	&#x2022;	IVR (Interactive Voice Response) ou URA (unidade de resposta aud&#xED;vel)&#x2028;O IVR ou URA &#xE9; um recurso muito valioso em centrais telefonicas do tipo PBX, j&#xE1; que com este recurso podemos fazer atentimentos autom&#xE1;ticos e distribuir a chamada conforme respostas do usu&#xE1;rio, al&#xE9;m disso podemos integrar a URA com o Arduino permitindo assim uma intera&#xE7;&#xE3;o totalmente autom&#xE1;tica entre o usu&#xE1;rio e o Arduino ou o Arduino e o Asterisk para fazer liga&#xE7;&#xF5;es para o usu&#xE1;rio.&#x2028;&lt;br/&gt;	&#x2022;	ACD (Automatic Call Distribution)&#x2028;ACD permite que as liga&#xE7;&#xF5;es que chegam a central PBX sejam distribu&#xED;das conformem regras pre-estabelecidas, integrando a central com o Arduino podemos intervir nas regras de chamada conforme par&#xE2;metros coletados por ele.&#x2028;&lt;br/&gt;	&#x2022;	 FXO e FXS&#x2028;Foreign Exchange Office e Foreign Exchange Sation, s&#xE3;o tipos de canais (Channel), s&#xE3;o canais telef&#xF4;nicos como em centrais PBXs, &#x2028;A FXO &#xE9; como um aparelho telef&#xF4;nico, recebe sinais de controle como o sinal de chamada.&#x2028;J&#xE1; a FXS &#xE9; como uma sa&#xED;da da central telef&#xF4;nica gerando sinaliza&#xE7;&#xE3;o e tamb&#xE9;m oferece alimenta&#xE7;&#xE3;o el&#xE9;trica para funcionamento do aparelho telef&#xF4;nico.&#x2028;Por exemplo para se conectar uma linha telef&#xF4;nica comum (PSTN) a um computador voc&#xEA; precisa de um placa que tenha uma entrada FXO. J&#xE1; para ligar seu telefone ao computador e este simular uma central telefonica voc&#xEA; precisa de um canal FXS.&#x2028;&lt;br/&gt;	&#x2022;	 PSTN (PUBLIC SWITCHED TELEPHONE NETWORK)&#x2028;&#xC9; a sua operadora telef&#xF4;nica, em especial toda a infraestrutura que a constr&#xF5;e.&#x2028;&lt;br/&gt;	&#x2022;	 POTS (Plain Old Telephone Service)&#x2028;&#xC9; o sistema telef&#xF4;nico cl&#xE1;ssico, amplamente utilizado no mundo, mesmo com o advento de linhas telef&#xF4;nicas como ISDN, ADSL, Fibra &#xD3;tica e Telefonica Celular.&#x2028;&lt;br/&gt;	&#x2022;	 ATA (Analog Telephone Adapter)&#x2028;ATA &#xE9; um adaptador de telefone comum para telefone IP, permitindo que se conecte um telefone padr&#xE3;o a sua rede IP e assim receber e fazer chamadas, um ATA normalmente &#xE9; um dispositivo FXS.&#x2028;&lt;br/&gt;	&#x2022;	 Channel&#x2028;S&#xE3;o canais de comunica&#xE7;&#xE3;o, por onde h&#xE1; trafego de dados ou audio entre por exemplo o Asterisk e um ATA, no Asterisk n&#xE3;o se distingue canais originador ou destino de chamada, nem mesmo canais FXO ou FXS.&#x2028;&lt;br/&gt;	&#x2022;	 SIP&#x2028;&lt;br/&gt;	&#x2022;	 Console</description>
      <iweb:image href="Media/object001_1.jpg"></iweb:image>
      <iweb:comment enabled="0" count="0" link="http://www.carlosdelfino.eti.br/Carlos_Delfino_-_Consultoria_e_Projetos/Artigos/Entradas/2014/7/11_Conceitos_relativos_ao_Asterisk_e_VOIP.html#comment_layer"></iweb:comment>
    </item>
    <item>
      <title>Configurando nosso primeiro RAMAL e uma URA</title>
      <link>http://www.carlosdelfino.eti.br/Carlos_Delfino_-_Consultoria_e_Projetos/Artigos/Entradas/2014/6/29_Configurando_nosso_primeiro_RAMAL_e_uma_URA.html</link>
      <guid isPermaLink="false">67ee0b4f-3abe-41b7-9fd8-b99a776a9816</guid>
      <pubDate>Sun, 29 Jun 2014 02:25:19 -0300</pubDate>
      <description>&lt;br/&gt;&lt;br/&gt;Pr&#xF3;ximos Passos&lt;br/&gt;Veremos no pr&#xF3;ximo tutorial como instalar o Softphone e testa-lo. Aguardem.&lt;br/&gt;&lt;br/&gt;Mais Informa&#xE7;&#xF5;es:&lt;br/&gt;Outras informa&#xE7;&#xF5;es sobre o Workshop podem ser obtidos no link: &lt;a href="https://www.facebook.com/events/1500419536839268/?ref=ts&amp;fref=ts"&gt;https://www.facebook.com/events/1500419536839268/&lt;/a&gt;</description>
      <iweb:comment enabled="0" count="0" link="http://www.carlosdelfino.eti.br/Carlos_Delfino_-_Consultoria_e_Projetos/Artigos/Entradas/2014/6/29_Configurando_nosso_primeiro_RAMAL_e_uma_URA.html#comment_layer"></iweb:comment>
    </item>
    <item>
      <title>Configurando o Asterisk para os primeiros passos</title>
      <link>http://www.carlosdelfino.eti.br/Carlos_Delfino_-_Consultoria_e_Projetos/Artigos/Entradas/2014/6/24_Configurando_o_Asterisk_para_os_primeiros_passos.html</link>
      <guid isPermaLink="false">e4edb895-3726-4c02-8097-a1ad30773dfc</guid>
      <pubDate>Tue, 24 Jun 2014 22:23:38 -0300</pubDate>
      <description>Acreditamos que voc&#xEA; ja tenha tido sucesso em instalar o Asterisk conforme o tutorial &#x201C;&lt;br/&gt;&lt;a href="http://carlosdelfino.eti.br/Carlos_Delfino_-_Consultoria_e_Projetos/Artigos/Entradas/2014/6/24_Instalacao_do_Asterisk_para_uso_com_Arduino.html"&gt;Instala&#xE7;&#xE3;o do Asterisk para Uso com Arduino&#x201D;&lt;/a&gt;&lt;br/&gt;&lt;br/&gt;O primeiro passo a ser dado com o Asterisk, ap&#xF3;s sua instala&#xE7;&#xE3;o, ser&#xE1; configurar as extens&#xF5;es e canais de comunica&#xE7;&#xE3;o, usaremos apenas um tipo de canal,  controlado pelos protocolos SIP, o que ser&#xE1; suficiente para tudo que desejamos apresentar e muito mais.&lt;br/&gt;&lt;br/&gt;Antes de Come&#xE7;ar, Alguns Conceitos&lt;br/&gt;&lt;br/&gt;Para se usar o Asterisk &#xE9; preciso consolidar alguns conceitos, dentre eles:&lt;br/&gt;&lt;br/&gt;	&#x2022;	Canais de Audio&lt;br/&gt;	&#x2022;	&lt;a href="http://goo.gl/wvgPGw"&gt;Ramais&lt;/a&gt;&lt;br/&gt;	&#x2022;	&lt;a href="http://goo.gl/uVdtp9"&gt;URA&lt;/a&gt;&lt;br/&gt;	&#x2022;	Planos de Discagem&lt;br/&gt;	&#x2022;	M&#xF3;dulos/Extens&#xF5;es&lt;br/&gt;&lt;br/&gt;Considerando que voc&#xEA; j&#xE1; conhece tais conceitos vamos continuar.&lt;br/&gt;&lt;br/&gt;Arquivos de configura&#xE7;&#xE3;o Importantes&lt;br/&gt;&lt;br/&gt;Durante a instala&#xE7;&#xE3;o usamos o comando &#x201C;make samples&#x201D; para que tenhamos configura&#xE7;&#xF5;es padr&#xF5;es para uso do Asterisk, mas estas configura&#xE7;&#xF5;es n&#xE3;o nos atende, portanto vamos fazer um backup delas, criando um diret&#xF3;rio &#x201C;backup&#x201D; e movendo todos os arquivos que est&#xE3;o na pasta &#x201C;/etc/asterisk&#x201D; para a pasta de bakcup, por&#xE9;m mantenha uma copia dos seguintes arquivos:&lt;br/&gt;&lt;br/&gt;	&#x2022;	asterisk.conf&lt;br/&gt;	&#x2022;	indications.conf&lt;br/&gt;	&#x2022;	logger.conf&lt;br/&gt;	&#x2022;	cel.conf&lt;br/&gt;	&#x2022;	features.conf&lt;br/&gt;	&#x2022;	modules.conf&lt;br/&gt;&lt;br/&gt;Deixe todos os arquivos intactos, por&#xE9;m sugiro que liste o conte&#xFA;do de cada um para se familiarizar mais com as configura&#xE7;&#xF5;es, o arquivo asterisk.conf e logger.conf podem ter configura&#xE7;&#xF5;es de depura&#xE7;&#xE3;o alteradas para melhorar a visualiza&#xE7;&#xE3;o de mensagens de erros.&lt;br/&gt;&lt;br/&gt;Quais M&#xF3;dulos iremos Usar&lt;br/&gt;&lt;br/&gt;O primeiro arquivo que vamos intervir &#xE9; o arquivo &#x201C;modules.conf&#x201D;, este arquivo informa ao Asterisk como carregar os m&#xF3;dulos necess&#xE1;rio ao nosso ambiente. O Asterisk &#xE9; um software totalmente modular e al&#xE9;m de vir com todos os m&#xF3;dulos/extens&#xF5;es necess&#xE1;rios para nosso trabalho, possui uma API bem madura para se desenvolver novos m&#xF3;dulos.&lt;br/&gt;&lt;br/&gt;Neste arquivo originalmente ele pede para que o Asterisk fa&#xE7;a a carga autom&#xE1;tica dos m&#xF3;dulos, por&#xE9;m queremos carregar apenas m&#xF3;dulos que nos s&#xE3;o interessantes, j&#xE1; que com a carga autom&#xE1;tica &#xE9; carregado uma grande quantidade de m&#xF3;dulos desnecess&#xE1;rios. &lt;br/&gt;&lt;br/&gt;Portanto vamos criar um arquivo novo com apenas os m&#xF3;dulos que iremos precisar em nosso Workshop.&lt;br/&gt;&lt;br/&gt;Vamos come&#xE7;&#xE1;r criando o arquivo de novo &#x201C;modules.conf&#x201D; e na primeira linha coloque a diretiva que indica inicio de sec&#xE3;o &#x201C;[modules]&#x201D;, em seguida na pr&#xF3;xima linha coloque o parametro &#x201C;autoload&#x201D;, com a op&#xE7;&#xE3;o &#x201C;no&#x201D;, veja abaixo o exemplo de com ficar&#xE1; o arquivo, neste exemplo j&#xE1; listo todos os m&#xF3;dulos necess&#xE1;rios e como devem ser carregados:&lt;br/&gt;&lt;br/&gt;Agora abaixo da diretiva autoload, coloque as diretivas conforme o exemplo a seguir, explicarei depois do exemplo os grupos de diretivas:&lt;br/&gt;&lt;br/&gt;[modules]&lt;br/&gt;autoload=no&lt;br/&gt;;&lt;br/&gt;; Modulo de Configura&#xE7;&#xE3;o por Arquivo&lt;br/&gt;preload=pbx_config.so&lt;br/&gt;;&lt;br/&gt;; M&#xF3;dulos de Aplica&#xE7;&#xE3;o com fun&#xE7;&#xF5;es para planos de discagem&lt;br/&gt;load=app_system.so&lt;br/&gt;load=app_verbose.so&lt;br/&gt;load=app_dial.so&lt;br/&gt;load=app_record.so&lt;br/&gt;load=app_userevent.so&lt;br/&gt;load=app_playtones.so&lt;br/&gt;load=app_playback.so&lt;br/&gt;load=app_sayunixtime.so&lt;br/&gt;;&lt;br/&gt;; Recursos&lt;br/&gt;load=res_rtp_asterisk.so&lt;br/&gt;; Recurso que ira fazer a integrac&#xE3;o com scripts que se comunicam com Arduino&lt;br/&gt;load=res_agi.so&lt;br/&gt;;&lt;br/&gt;; Codecs de Audio&lt;br/&gt;load=codec_alaw.so&lt;br/&gt;load=codec_ulaw.so&lt;br/&gt;load=codec_gsm.so&lt;br/&gt;load=codec_ilbc.so&lt;br/&gt;;&lt;br/&gt;; Fun&#xE7;&#xF5;es para Planos de Discagem&lt;br/&gt;load=func_dialgroup.so&lt;br/&gt;load=func_dialplan.so&lt;br/&gt;load=func_callerid.so&lt;br/&gt;load=func_channel.so&lt;br/&gt;;&lt;br/&gt;; Canais de Audio Local&lt;br/&gt;noload=chan_alsa.so&lt;br/&gt;noload=chan_oss.so&lt;br/&gt;load=chan_console.so&lt;br/&gt;; Canais de Audio VOIP, usaremos apenas SIP para os ramais&lt;br/&gt;load=chan_sip.so&lt;br/&gt;load=chan_aix.so&lt;br/&gt;;&lt;br/&gt;; Formatos de audio, observe diretiva &#x201C;noload&#x201D;, diz para n&#xE3;o carregar&lt;br/&gt;noload=format_g719.so&lt;br/&gt;load=format_ilbc.so&lt;br/&gt;load=format_g723.so&lt;br/&gt;load=format_jpeg.so&lt;br/&gt;load=format_sln.so&lt;br/&gt;noload=format_sln16.so&lt;br/&gt;noload=format_g726.so&lt;br/&gt;noload=format_mp3.so&lt;br/&gt;load=format_vox.so&lt;br/&gt;load=format_g729.so&lt;br/&gt;load=format_ogg_vorbis.so&lt;br/&gt;load=format_wav_gsm.so&lt;br/&gt;load=format_gsm.so&lt;br/&gt;load=format_pcm.so&lt;br/&gt;load=format_wav.so&lt;br/&gt;noload=format_h263.so&lt;br/&gt;noload=format_siren14.so&lt;br/&gt;noload=format_h264.so&lt;br/&gt;noload=format_siren7.so&lt;br/&gt;&lt;br/&gt;Como pode ser visto nos coment&#xE1;rios, carregamos primeiro um modulo que ir&#xE1; cuidar da configura&#xE7;&#xE3;o, este modulo nos oferece recurso como recargar de configura&#xE7;&#xE3;o, e principalmente a possibilidade de se usar arquivos de configura&#xE7;&#xE3;o em formato texto.&lt;br/&gt;&lt;br/&gt;O m&#xF3;dulo de configura&#xE7;&#xE3;o e carregado com a diretiva &#x201C;preload&#x201D; para que seja carregado com anteced&#xEA;ncia.&lt;br/&gt;&lt;br/&gt;Em seguida, carregamos m&#xF3;dulos de aplica&#xE7;&#xE3;o e &#xFA;teis ao plano de discagem, por&#xE9;m o que mais nos interessa e que iremos lidar mais, al&#xE9;m do plano de discagem propriamente dito, ser&#xE1; o m&#xF3;dulo &#x201C;res_agi.so&#x201D;, este m&#xF3;dulo &#xE9; respons&#xE1;vel pela integra&#xE7;&#xE3;o com aplica&#xE7;&#xF5;es externas, funcionando como um Gateway para o Asterisk e tais aplica&#xE7;&#xF5;es, ser&#xE1; atrav&#xE9;s deste recurso que iremos ver como desenvolver scripts para se comunicar com o Arduino.&lt;br/&gt;&lt;br/&gt;Os m&#xF3;dulos de prefixo &#x201C;chan_&#x201D;, criam os canais de audio e voip necess&#xE1;rio ao funcionamento do Asterisk e todo o PBX e os m&#xF3;dulos de prefixo &#x201C;format_&#x201D; carregam recursos para tratamentos dos arquivos de &#xE1;udio nos formatos identificados, ser&#xE3;o &#xFA;teis para gravar e reproduzir arquivos de &#xE1;udio.&lt;br/&gt;&lt;br/&gt;Ap&#xF3;s esta mudan&#xE7;a precisamos reiniciar o Asterisk j&#xE1; que fizemos muda&#xE7;as em praticamente todos os arquivos de configura&#xE7;&#xE3;o, reiniciando &#xE9; mais seguro se ter o resultado desejado.&lt;br/&gt;&lt;br/&gt;Por&#xE9;m, ao se alterar apenas arquivos de configura&#xE7;&#xF5;es pode se usar o comando &#x201C;rasterisk&#x201D; que veremos a seguir.&lt;br/&gt;&lt;br/&gt;Pr&#xF3;ximos Passos&lt;br/&gt;Veremos no pr&#xF3;ximo tutorial como criar nosso primeiro canal de comunica&#xE7;&#xE3;o e nossos ramais. Aguardem.&lt;br/&gt;&lt;br/&gt;Mais Informa&#xE7;&#xF5;es:&lt;br/&gt;Outras informa&#xE7;&#xF5;es sobre o Workshop podem ser obtidos no link: &lt;a href="https://www.facebook.com/events/1500419536839268/?ref=ts&amp;fref=ts"&gt;https://www.facebook.com/events/1500419536839268/&lt;/a&gt;</description>
      <iweb:image href="Media/object009.png"></iweb:image>
      <iweb:comment enabled="0" count="0" link="http://www.carlosdelfino.eti.br/Carlos_Delfino_-_Consultoria_e_Projetos/Artigos/Entradas/2014/6/24_Configurando_o_Asterisk_para_os_primeiros_passos.html#comment_layer"></iweb:comment>
    </item>
    <iweb:dateFormat>EEEE, d 'de' MMMM 'de' y</iweb:dateFormat>
    <iweb:baseURL>http://www.carlosdelfino.eti.br/Carlos_Delfino_-_Consultoria_e_Projetos/Artigos</iweb:baseURL>
    <iweb:maximumSummaryItems>5</iweb:maximumSummaryItems>
  </channel>
</rss>
